app/helpers/application_helper.rb

    def current_user
        return unless session[:user_id]
        @current_user ||= User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]