app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (?, ?, ?, ?, ?)  [["id", 2], ["id", 3], ["id", 5], ["id", 6], ["id", 10]]
---
    def set_cart
      @cart = Cart.includes(:line_items, :products).find(params[:id])