app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "rikai"], ["LIMIT", 1]]
---
  def create
    # find user by name
    # check password
    # create session
    user = User.find_by_name params[:name]