app/controllers/concerns/current_cart.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cart
        @cart = Cart.find(session[:cart_id])